app/controllers/posts_controller.rb

      def create
        @post = Post.new(params.require(:post).permit(:title, :start_date, :end_date, :all_day, :memo))
        if @post.save
---
INSERT INTO "posts" ("title", "all_day", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["all_day", 0], ["memo", ""], ["created_at", "2021-07-01 09:17:10.778622"], ["updated_at", "2021-07-01 09:17:10.778622"]]

      def update
        @post = Post.find(params[:id])
        if @post.update(params.require(:post).permit(:title, :start_date, :end_date, :all_day, :schedule_memo))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "start_date" = ?, "end_date" = ?, "memo" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "英語"], ["start_date", "2021-07-02"], ["end_date", "2021-07-02"], ["memo", "スワヒリ"], ["updated_at", "2021-07-01 09:21:22.070631"], ["id", 2]]